app/controllers/tasks_controller.rb

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def show
    # Show details for one book
    task_id = params[:id].to_i
    @task = Task.find_by(id: task_id)

INSERT INTO "tasks" ("name", "description", "completion_date", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "Movies"], ["description", "Go see new HP movie"], ["completion_date", ""], ["created_at", "2018-09-22 04:09:36.689552"], ["updated_at", "2018-09-22 04:09:36.689552"]]
---
  def create
    # Uses post to send form data to the server/save a new book
    @task = Task.new(task_params)
    if @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
---
  def edit
    # Form to edit details for an existing book.
    # When you submit the form, it sends a patch request to update the databse
    # Is giong to redirect before rendering new :(.
    # Probably something to do with the if statement
    @task = Task.find(params[:id].to_i)

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "description" = $1, "completion_date" = $2, "updated_at" = $3 WHERE "tasks"."id" = $4  [["description", "Send before birthday on Tuesday"], ["completion_date", ""], ["updated_at", "2018-09-22 05:17:52.013174"], ["id", 8]]
---
  def update
    # Sends form data to the server to update an existing task.
    @task = Task.find(params[:id].to_i)
    @task.update(name: params[:task][:name], description: params[:task][:description], completion_date: params[:task][:completion_date])

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
DELETE FROM "tasks" WHERE "tasks"."id" = $1  [["id", 7]]
---
    task = Task.find_by(id: params[:id].to_i)
    # Destroys an existing book and returns to home page
    task.destroy

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "updated_at" = $1, "completion_date" = $2 WHERE "tasks"."id" = $3  [["updated_at", "2018-09-22 05:16:36.974448"], ["completion_date", "2018-09-22"], ["id", 8]]
---
  def complete
    @task = Task.find_by(id: params[:id].to_i)
    @task.completion_date = @task.updated_at.to_date.to_s
    @task.save

SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = $1 LIMIT $2  [["id", 8], ["LIMIT", 1]]
UPDATE "tasks" SET "completion_date" = $1, "updated_at" = $2 WHERE "tasks"."id" = $3  [["completion_date", nil], ["updated_at", "2018-09-22 05:16:58.332369"], ["id", 8]]
---
    def incomplete
      @task = Task.find_by(id: params[:id].to_i)
      @task.completion_date = nil
      @task.save